<a href="https://colab.research.google.com/github/Jahid11186/NumpyPandas-101/blob/main/Pandas/Pandas_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Basics
* Data is not always available in desired format. so that Data Processing is an important part of analyzing the data.
* various processing are required before analyzing the data, such as
    * Cleaning
    * Restructuring
    * Merging etc

## Data Structures

* Series
* DataFrame

### Series


> The Series is a one-dimensional array that can store various data types, including mix data types. 

> The row labels in a series are called the index

> Any list, tuples and dictionary can be converted in to series using **Series** method

In [ ]:
import pandas as pd

In [ ]:
h = ('AA', '2020-02-01', 100, 10.2)
s = pd.Series(h)
type(s)

pandas.core.series.Series

In [ ]:
h

('AA', '2020-02-01', 100, 10.2)

In [ ]:
s

0            AA
1    2020-02-01
2           100
3          10.2
dtype: object

In [ ]:
dic = {
    'name': "Jahid",
    'ID' : '181-15-11186',
    "Dept": "CSE"
}

In [ ]:
ds = pd.Series(dic)
ds

name           Jahid
ID      181-15-11186
Dept             CSE
dtype: object

In [ ]:
type(dic)

dict

In [ ]:
type(ds)

pandas.core.series.Series

In [ ]:
f = ["FB", "2001-08-02", 90, 3.2]
fs = pd.Series(f, index= ['Name', 'Date', 'Shares', 'Price'])
fs

Name              FB
Date      2001-08-02
Shares            90
Price            3.2
dtype: object

In [ ]:
fs.Shares

90

In [ ]:
fs['Shares']

90

In [ ]:
fs[0]

'FB'

In [ ]:
fs[['Shares', 'Price']]

Shares     90
Price     3.2
dtype: object

### DataFrame

> DataFrame is the widely used data structure of pandas

> DataFrame can be used with 2 dimensional arrays

> DataFrame has 2 different index
* Column index
* Row index

> Text files and spreadsheets are read as DataFrame

In [ ]:
data = {
    'Name': ["IBM", "Google", "Amazon", "Microsoft"],
    'Date': ['2001-12-01', '2012-02-10', '2010-11-03', '2010-02-01'],
    'Shares': [1200, 1700, 1500, 3100],
    'Price': [12.3, 10.3, 32.3, 37.333]
}

In [ ]:
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [ ]:
df

        Name        Date  Shares   Price
0        IBM  2001-12-01    1200  12.300
1     Google  2012-02-10    1700  10.300
2     Amazon  2010-11-03    1500  32.300
3  Microsoft  2010-02-01    3100  37.333

In [ ]:
df['Owner'] = 'Unknown'
df

        Name        Date  Shares   Price    Owner
0        IBM  2001-12-01    1200  12.300  Unknown
1     Google  2012-02-10    1700  10.300  Unknown
2     Amazon  2010-11-03    1500  32.300  Unknown
3  Microsoft  2010-02-01    3100  37.333  Unknown

In [ ]:
df.index = ['one', 'two', 'three', 'four']
df

            Name        Date  Shares   Price    Owner
one          IBM  2001-12-01    1200  12.300  Unknown
two       Google  2012-02-10    1700  10.300  Unknown
three     Amazon  2010-11-03    1500  32.300  Unknown
four   Microsoft  2010-02-01    3100  37.333  Unknown

In [ ]:
df['Shares']

one      1200
two      1700
three    1500
four     3100
Name: Shares, dtype: int64

Data can be accessed in 2 ways

* Using row
* Using column

In [ ]:
# using Column
df.Shares

one      1200
two      1700
three    1500
four     3100
Name: Shares, dtype: int64

In [ ]:
# Using Columns
df['Name']

one            IBM
two         Google
three       Amazon
four     Microsoft
Name: Name, dtype: object

In [ ]:
# Using Row
df.loc[:, 'Name']

one            IBM
two         Google
three       Amazon
four     Microsoft
Name: Name, dtype: object

In [ ]:
df.iloc[:3]

         Name        Date  Shares  Price    Owner
one       IBM  2001-12-01    1200   12.3  Unknown
two    Google  2012-02-10    1700   10.3  Unknown
three  Amazon  2010-11-03    1500   32.3  Unknown

In [ ]:
del df['Owner']
df

            Name        Date  Shares   Price
one          IBM  2001-12-01    1200  12.300
two       Google  2012-02-10    1700  10.300
three     Amazon  2010-11-03    1500  32.300
four   Microsoft  2010-02-01    3100  37.333

In [ ]:
df.drop('Shares', axis = 1)

            Name        Date   Price
one          IBM  2001-12-01  12.300
two       Google  2012-02-10  10.300
three     Amazon  2010-11-03  32.300
four   Microsoft  2010-02-01  37.333

In [ ]:
df

            Name        Date  Shares   Price
one          IBM  2001-12-01    1200  12.300
two       Google  2012-02-10    1700  10.300
three     Amazon  2010-11-03    1500  32.300
four   Microsoft  2010-02-01    3100  37.333